cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Essential tools
brew 'mise'
brew 'wget'
brew 'curl'
brew 'jq'
brew 'ripgrep'
brew 'ack'
brew 'openssl'
brew 'ghostty'
brew 'git'
brew 'git-lfs'

# Security
brew 'gnupg'
brew '1password-cli'

# AWS tools
brew 'awscli'
brew 'aws-vault'

# JavaScript/TypeScript
brew 'bun'
brew 'node' # Keep for compatibility

# Databases
brew 'postgresql@15'
brew 'redis'
brew 'sqlite'

# Elixir support
brew 'wxwidgets' # for LiveBook
brew 'libxml2'
brew 'libxslt'

# Font for terminal
cask 'font-jetbrains-mono-nerd-font'
cask 'font-fira-code-nerd-font'

# Apps
cask '1password'
cask 'cursor'
cask 'google-chrome'
cask 'slack'
cask 'discord'
cask 'rectangle' # Window management
cask 'docker'

# Remove unused tools
# brew 'ruby-install'
# brew 'chruby'
# brew 'yarn'
# cask 'atom'
# cask 'tunnelbear'
